/*
1. Числа:
  - С плавающей точкой: числа вроде 1.21323, 4, -33.5, 100004 или 0.123;
  - Целые: числа вроде 1, 12, -33, 140, но не 1.233;
2. Строка: строка текста, такая как "лодка", "слон" или "ну ты, блин, и дылда!";
3. Логический тип: только true (истина) или false (ложь), больше ничего;
4. Массивы: совокупность значений таких как: 1, 2, 3, 4, 'мне скучно';
5. Объекты: представление более сложного объекта;
6. null: переменная, которая содержит значение NULL, но не содержит корректное число, строку, логический тип, массив или объект;
7. undefined: неопределённое значение получается, когда вы используете несуществующее свойство объекта или переменной, которая была объявлена, но не содержит никакого значения.
*/
